---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.OnInstanceEnd(Autodesk.Revit.DB.InstanceNode)
source: html/d1340660-fcc9-3bfd-58fb-8d114aa39517.htm
---
# Autodesk.Revit.DB.IExportContext.OnInstanceEnd Method

This method marks the end of processing of an Instance Node (e.g. a family instance).

## Syntax (C#)
```csharp
void OnInstanceEnd(
	InstanceNode node
)
```

## Parameters
- **node** (`Autodesk.Revit.DB.InstanceNode`) - An output node that represents a family instance.